# DATA CONSISTENCY CHECK EXERCISES

Importing Libraries

In [1]:
#importing libraries
import pandas as pd
import numpy as np
import os

Importing Data sets

In [2]:
#assign string path
path = r'C:\Users\ddgal\OneDrive\Desktop\Career Foundry Tasks\Data Immersion\22-03-2023 Instacart Basket Analysis'

In [3]:
#import df_prods
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [4]:
#import df_ords
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

# Mixed-Type Data

In [5]:
#create a data frame
df_test = pd.DataFrame()

In [6]:
#create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [7]:
#print created data frame
df_test

    mix
0     a
1     b
2     1
3  True

In [8]:
#check for mixed type
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [9]:
#change from mix type to string
df_test['mix'] = df_test['mix'].astype('str')

# Missing Values

In [10]:
#find mising values in df_prods
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [11]:
#create new subset displaying missing values in product name from df_prods
df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [12]:
#checking number of columns and rows for df_prods before removing missing values
df_prods.shape

(49693, 5)

In [13]:
#create new subset and remove rows with missing values from product_name in df_prods
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [14]:
#make sure it removed the right rows so 49693-16 = 49677
df_prods_clean.shape

(49677, 5)

# Finding Duplicates

In [15]:
#creates new subset of df_prods_clean that finds duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [16]:
#number of rows and columns for df_prods_clean before removing duplicates
df_prods_clean.shape

(49677, 5)

In [17]:
#creates new subset of df_prods_clean with no duplicates and checks number of rows and columns (should be (49672,5))
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()
df_prods_clean_no_dups.shape

(49672, 5)

# TASK QUESTIONS

2)  Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.
Tip: Keep an eye on min and max values!

In [18]:
#run decriptive statistics on df_ords
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

I do not see any inconsistencies in the df_ords from the descriptive statistics.

3) Check for mixed-type data in your df_ords dataframe.

In [19]:
#find mixed-type data
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

4) If you find mixed-type data, fix it. The column in question should contain observations of a single data type.

There is no mix type data in df_ords.

5) Run a check for missing values in your df_ords dataframe.
In a markdown cell, report your findings and propose an explanation for any missing values you find.

In [20]:
#find missing values in df_ords
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

The days_since_prior_order has 63,100 missing values.  This constitutes 6% of the data for that column.  Perhaps, these values are supposed to be 0, we need to create a subset showing these null values to determine if there is any pattern.

In [21]:
#create subset of null values in df_ords
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

All the null values for days_since_prior_order correspond with order_number 1.  This means these were the very first orders made so there are no days since last order.

6) Address the missing values using an appropriate method.
In a markdown cell, explain why you used your method of choice.

After careful consideration, I have decided not to do anything with the missing values in days_since_prior_order column in df_ords.  We cannot remove them since they consist of 6% of the data set (more than 5%).  I, also do not think it is appropriate to replace the null values with other numeric values.  Since they all correspond with order_number 1, it tells me that this is a new customer.  Only a new customer can have a null value in days_since_prior_order since this would be their first purchase.  This also explains why order_number 1 has various user_ids and order_ids.  New customers come in all the time so it makes sense for them to have different user_ids and order_ids. Perhaps, at some point a new string column can be created using order_number 1 as a way to distinguish between a new or existing customer.  The 0 values already there represent someone who made more than one purchase in a day, hence starting from the second purchase there would be 0 days_since_prior_order.

7) Run a check for duplicate values in your df_ords data.
In a markdown cell, report your findings and propose an explanation for any duplicate values you find.

In [22]:
#checking for duplicates
df_ords_dup = df_ords[df_ords.duplicated()]
df_ords_dup

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

No duplicates found in df_ords data set.

8) Address the duplicates using an appropriate method.
In a markdown cell, explain why you used your method of choice
There were no duplicates found so nothing was done.  If there had been duplicates, we would have created a new subset with no duplicates using the following code to remove them:
df_ords_nodups = df_ords.drop_duplicates()

9) Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [23]:
#export consistency checked df_prods_clean_no_dups and df_ords files to prepared data folder
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))